Revit 2027 API
SynchronizeWithCentralOptions.SetRelinquishOptions Method
 Sets the options which govern whether or not to relinquish elements and workset types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRelinquishOptions(
	RelinquishOptions relinquishOptions
)
Public Sub SetRelinquishOptions (
	relinquishOptions As RelinquishOptions
)
public:
void SetRelinquishOptions(
	RelinquishOptions^ relinquishOptions
)
member SetRelinquishOptions :
        relinquishOptions : RelinquishOptions -> unit
Parameters
relinquishOptions RelinquishOptions
 The options. If null, synchronize with central will relinquish the current user's ownership of all worksets and all elements.
See Also
Reference
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace